## Manipulating Pandas DataFrames

In [2]:
import pandas as pd
data = {'first':['ali','sepideh','nadia'],
        'last':['abdaal','hosseinian','masoumi'],
        'age':[30,33,29]}
clients= pd.DataFrame(data=data)

     first        last  age
0      ali      abdaal   30
1  sepideh  hosseinian   33
2    nadia     masoumi   29

### Renaming

In [3]:
clients.rename(columns={'first':'First Name'})

  First Name        last  age
0        ali      abdaal   30
1    sepideh  hosseinian   33
2      nadia     masoumi   29

In [4]:
clients.rename(index={0:'a',1:'b',2:'c'})

     first        last  age
a      ali      abdaal   30
b  sepideh  hosseinian   33
c    nadia     masoumi   29

In [5]:
clients.rename(index={0:'a',1:'b',2:'c'},inplace=True)

In [6]:
clients

     first        last  age
a      ali      abdaal   30
b  sepideh  hosseinian   33
c    nadia     masoumi   29

In [7]:
clients.reset_index(inplace=True)

### Dropping

In [8]:
clients.drop(columns='first')

  index        last  age
0     a      abdaal   30
1     b  hosseinian   33
2     c     masoumi   29

In [9]:
clients.drop(index=0)

  index    first        last  age
1     b  sepideh  hosseinian   33
2     c    nadia     masoumi   29

### Set Type

In [10]:
clients.age

0    30
1    33
2    29
Name: age, dtype: int64

In [11]:
clients.age.astype(int)

0    30
1    33
2    29
Name: age, dtype: int64